Autodesk.Revit.DB.Electrical.AreaBasedLoadData.PowerFactorState
The power factor state of the area based load.
Remarks:
This property is used to retrieve the power factor state of the area based load.
Since:
2025

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.PhasesNumber
The number of electrical phases of the area based load.
Remarks:
This property is used to retrieve the number of electrical phases.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The number of electrical phases numberOfPhases is not valid, only 1, 3 is valid.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.ConnectedPhases
The electrical connected phases of the area based load to its upstream node.
Remarks:
Will return a default value if no upstream node.
Since:
2025

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.IsInAnInvalidState
Whether the load is in an invalid state (the load does not match the upstream distribution system).
Since:
2023